proglang/ml.org
#+title: The ML Programming Language
#+author: Mayer Goldberg
#+email: gmayer@little-lisper.org
#+options: creator:nil
#+keywords: Mayer Goldberg, programming languages, functional programming languages, hindley-milner type system, module system, standard ml of new jersey, sml, sml/nj, compiler construction

* What is ML
* Why ML?
* Resources on ML
** Books on ML
# <<books-on-ml>>
PLEASE read the following [[./disclaimer-on-books.html][disclaimer]]

- [[http://www.amazon.com/Elements-ML-Programming-ML97-2nd/dp/0137903871/ref=pd_sim_b_img_3][Elements of ML Programming]]
  - Solutions to the problems in the book
- [[http://www.amazon.com/Introduction-Programming-International-Computer-Science/dp/0201398206/ref=pd_bbs_sr_1?ie=UTF8&s=books&qid=1205800737&sr=1-1][Introduction to Programming Using SML]]
  - [[http://www.it.dtu.dk/introSML/][Website at DTU (programs, errata, etc)]]
  - Solutions to the problems in the book
- [[http://www.amazon.com/ML-Working-Programmer-Lawrence-Paulson/dp/052156543X/ref=pd_sim_b_img_1][ML for the Working Programmer]]
  - Solutions to the problems in the book
- [[http://www.amazon.com/Modern-Compiler-Implementation-Andrew-Appel/dp/0521607647/ref=pd_sim_b_img_5][Modern Compiler Implementation in ML]]
- [[http://www.amazon.com/Purely-Functional-Structures-Chris-Okasaki/dp/0521663504/ref=pd_sim_b_title_4][Purely Functional Data Structures]]
- [[http://www.amazon.com/Definition-Standard-ML-Revised/dp/0262631814/ref=sr_1_1?ie=UTF8&s=books&qid=1205800168&sr=1-1][The Definition of Standard ML]]
- [[http://www.amazon.com/Functional-Approach-Programming-Guy-Cousineau/dp/0521576814/ref=pd_ecc_rvi_cart_f][The functional approach to programming]]
- [[http://www.amazon.com/Little-MLer-Matthias-Felleisen/dp/026256114X/ref=pd_bbs_sr_1?ie=UTF8&s=books&qid=1205800788&sr=1-1][The Little MLer]]
- [[http://www.amazon.com/Standard-ML-Basis-Library/dp/0521794781/ref=pd_bxgy_b_text_b][The Standard ML Basis Library (printed book version)]]
** Online resources
- [[http://en.wikipedia.org/wiki/ML_%28programming_language%29][ML at the Wikipedia]]
* Dialects of ML
* My FAQ about ML
* My programs in ML
