proglang/ml.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>The ML Programming Language</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-02-20 15:05:04 IST"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">The ML Programming Language</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 What is ML </a></li>
<li><a href="#sec-2">2 Why ML? </a></li>
<li><a href="#sec-3">3 Resources on ML </a>
<ul>
<li><a href="#sec-3_1">3.1 Books on ML </a></li>
<li><a href="#sec-3_2">3.2 Online resources </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Dialects of ML </a></li>
<li><a href="#sec-5">5 My FAQ about ML </a></li>
<li><a href="#sec-6">6 My programs in ML </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is ML </h2>
<div class="outline-text-2" id="text-1">

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Why ML? </h2>
<div class="outline-text-2" id="text-2">

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Resources on ML </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><a name="books-on-ml" id="books-on-ml"></a><span class="section-number-3">3.1</span> Books on ML </h3>
<div class="outline-text-3" id="text-3_1">

<p>PLEASE read the following <a href="./disclaimer-on-books.html">disclaimer</a>
</p>
<ul>
<li>
<a href="http://www.amazon.com/Elements-ML-Programming-ML97-2nd/dp/0137903871/ref=pd_sim_b_img_3">Elements of ML Programming</a>
<ul>
<li>
Solutions to the problems in the book
</li>
</ul>
</li>
<li>
<a href="http://www.amazon.com/Introduction-Programming-International-Computer-Science/dp/0201398206/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1205800737&amp;sr=1-1">Introduction to Programming Using SML</a>
<ul>
<li>
<a href="http://www.it.dtu.dk/introSML/">Website at DTU (programs, errata, etc)</a>
</li>
<li>
Solutions to the problems in the book
</li>
</ul>
</li>
<li>
<a href="http://www.amazon.com/ML-Working-Programmer-Lawrence-Paulson/dp/052156543X/ref=pd_sim_b_img_1">ML for the Working Programmer</a>
<ul>
<li>
Solutions to the problems in the book
</li>
</ul>
</li>
<li>
<a href="http://www.amazon.com/Modern-Compiler-Implementation-Andrew-Appel/dp/0521607647/ref=pd_sim_b_img_5">Modern Compiler Implementation in ML</a>
</li>
<li>
<a href="http://www.amazon.com/Purely-Functional-Structures-Chris-Okasaki/dp/0521663504/ref=pd_sim_b_title_4">Purely Functional Data Structures</a>
</li>
<li>
<a href="http://www.amazon.com/Definition-Standard-ML-Revised/dp/0262631814/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1205800168&amp;sr=1-1">The Definition of Standard ML</a>
</li>
<li>
<a href="http://www.amazon.com/Functional-Approach-Programming-Guy-Cousineau/dp/0521576814/ref=pd_ecc_rvi_cart_f">The functional approach to programming</a>
</li>
<li>
<a href="http://www.amazon.com/Little-MLer-Matthias-Felleisen/dp/026256114X/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1205800788&amp;sr=1-1">The Little MLer</a>
</li>
<li>
<a href="http://www.amazon.com/Standard-ML-Basis-Library/dp/0521794781/ref=pd_bxgy_b_text_b">The Standard ML Basis Library (printed book version)</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Online resources </h3>
<div class="outline-text-3" id="text-3_2">

<ul>
<li>
<a href="http://en.wikipedia.org/wiki/ML_%28programming_language%29">ML at the Wikipedia</a>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Dialects of ML </h2>
<div class="outline-text-2" id="text-4">

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> My FAQ about ML </h2>
<div class="outline-text-2" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> My programs in ML </h2>
<div class="outline-text-2" id="text-6">

</div>
</div>
<div id="postamble">
<p class="author"> Author: Mayer Goldberg
</p>
<p class="date"> Date: 2011-02-20 15:05:04 IST</p>
</div>
</div>
</body>
</html>
